01  WS-AREA. 
    05  WS-NUMBER PIC 9(5) VALUE 0. 
    05  WS-TABLE OCCURS 10 TIMES INDEXED BY WS-INDEX. 
       10  WS-TABLE-ENTRY PIC 9(3). 

PROCEDURE DIVISION. 
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 10 
        MOVE WS-INDEX TO WS-TABLE-ENTRY(WS-INDEX) 
    END-PERFORM. 

    DISPLAY "Table values:" 
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 10 
        DISPLAY WS-TABLE-ENTRY(WS-INDEX) 
    END-PERFORM.
    STOP RUN.